In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('01_04_empleados.csv', delimiter=";")

In [3]:
print(df.shape)

(145, 8)

- Desafío: Averiguar si nuestro dataframe tiene filas duplicadas

In [4]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
140    False
141    False
142    False
143    False
144    False
Length: 145, dtype: bool

In [5]:
df.duplicated().sum()

np.int64(2)

In [6]:
df["Duplicated"] = df.duplicated()

In [7]:
df.query("Duplicated")

,Nombre,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento,Duplicated
10,Selena,Femenino,Casado(a),24,6,2709,Sí,Contabilidad,True
34,Lucio,Masculino,Soltero(a),54,12,3317,No,Recursos Humanos,True

In [8]:
df.query("Nombre == 'Selena'")

,Nombre,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento,Duplicated
6,Selena,Femenino,Casado(a),24,6,2709,Sí,Contabilidad,False
10,Selena,Femenino,Casado(a),24,6,2709,Sí,Contabilidad,True